results/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/sprint-2.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 1m10s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  0m01.0s/1m10.0s

running (0m02.0s), 02/20 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 02/20 VUs  0m02.0s/1m10.0s

running (0m03.0s), 02/20 VUs, 7 complete and 0 interrupted iterations
default   [   4% ] 02/20 VUs  0m03.0s/1m10.0s

running (0m04.0s), 03/20 VUs, 12 complete and 0 interrupted iterations
default   [   6% ] 03/20 VUs  0m04.0s/1m10.0s

running (0m05.0s), 04/20 VUs, 18 complete and 0 interrupted iterations
default   [   7% ] 04/20 VUs  0m05.0s/1m10.0s

running (0m06.0s), 04/20 VUs, 26 complete and 0 interrupted iterations
default   [   9% ] 04/20 VUs  0m06.0s/1m10.0s

running (0m07.0s), 05/20 VUs, 35 complete and 0 interrupted iterations
default   [  10% ] 05/20 VUs  0m07.0s/1m10.0s

running (0m08.0s), 06/20 VUs, 45 complete and 0 interrupted iterations
default   [  11% ] 06/20 VUs  0m08.0s/1m10.0s

running (0m09.0s), 06/20 VUs, 57 complete and 0 interrupted iterations
default   [  13% ] 06/20 VUs  0m09.0s/1m10.0s

running (0m10.0s), 07/20 VUs, 70 complete and 0 interrupted iterations
default   [  14% ] 07/20 VUs  0m10.0s/1m10.0s

running (0m11.0s), 07/20 VUs, 84 complete and 0 interrupted iterations
default   [  16% ] 07/20 VUs  0m11.0s/1m10.0s

running (0m12.0s), 08/20 VUs, 99 complete and 0 interrupted iterations
default   [  17% ] 08/20 VUs  0m12.0s/1m10.0s

running (0m13.0s), 09/20 VUs, 114 complete and 0 interrupted iterations
default   [  19% ] 09/20 VUs  0m13.0s/1m10.0s

running (0m14.0s), 09/20 VUs, 132 complete and 0 interrupted iterations
default   [  20% ] 09/20 VUs  0m14.0s/1m10.0s

running (0m15.0s), 10/20 VUs, 151 complete and 0 interrupted iterations
default   [  21% ] 10/20 VUs  0m15.0s/1m10.0s

running (0m16.0s), 11/20 VUs, 171 complete and 0 interrupted iterations
default   [  23% ] 11/20 VUs  0m16.0s/1m10.0s

running (0m17.0s), 11/20 VUs, 193 complete and 0 interrupted iterations
default   [  24% ] 11/20 VUs  0m17.0s/1m10.0s

running (0m18.0s), 12/20 VUs, 216 complete and 0 interrupted iterations
default   [  26% ] 12/20 VUs  0m18.0s/1m10.0s

running (0m19.0s), 13/20 VUs, 240 complete and 0 interrupted iterations
default   [  27% ] 13/20 VUs  0m19.0s/1m10.0s

running (0m20.0s), 13/20 VUs, 266 complete and 0 interrupted iterations
default   [  29% ] 13/20 VUs  0m20.0s/1m10.0s

running (0m21.0s), 14/20 VUs, 292 complete and 0 interrupted iterations
default   [  30% ] 14/20 VUs  0m21.0s/1m10.0s

running (0m22.0s), 14/20 VUs, 320 complete and 0 interrupted iterations
default   [  31% ] 14/20 VUs  0m22.0s/1m10.0s

running (0m23.0s), 15/20 VUs, 349 complete and 0 interrupted iterations
default   [  33% ] 15/20 VUs  0m23.0s/1m10.0s

running (0m24.0s), 16/20 VUs, 378 complete and 0 interrupted iterations
default   [  34% ] 16/20 VUs  0m24.0s/1m10.0s

running (0m25.0s), 16/20 VUs, 410 complete and 0 interrupted iterations
default   [  36% ] 16/20 VUs  0m25.0s/1m10.0s

running (0m26.0s), 17/20 VUs, 443 complete and 0 interrupted iterations
default   [  37% ] 17/20 VUs  0m26.0s/1m10.0s

running (0m27.0s), 18/20 VUs, 477 complete and 0 interrupted iterations
default   [  39% ] 18/20 VUs  0m27.0s/1m10.0s

running (0m28.0s), 18/20 VUs, 512 complete and 0 interrupted iterations
default   [  40% ] 18/20 VUs  0m28.0s/1m10.0s

running (0m29.0s), 19/20 VUs, 549 complete and 0 interrupted iterations
default   [  41% ] 19/20 VUs  0m29.0s/1m10.0s

running (0m30.0s), 19/20 VUs, 587 complete and 0 interrupted iterations
default   [  43% ] 19/20 VUs  0m30.0s/1m10.0s

running (0m31.0s), 20/20 VUs, 626 complete and 0 interrupted iterations
default   [  44% ] 20/20 VUs  0m31.0s/1m10.0s

running (0m32.0s), 20/20 VUs, 666 complete and 0 interrupted iterations
default   [  46% ] 20/20 VUs  0m32.0s/1m10.0s

running (0m33.0s), 20/20 VUs, 706 complete and 0 interrupted iterations
default   [  47% ] 20/20 VUs  0m33.0s/1m10.0s

running (0m34.0s), 20/20 VUs, 746 complete and 0 interrupted iterations
default   [  49% ] 20/20 VUs  0m34.0s/1m10.0s

running (0m35.0s), 20/20 VUs, 786 complete and 0 interrupted iterations
default   [  50% ] 20/20 VUs  0m35.0s/1m10.0s

running (0m36.0s), 20/20 VUs, 826 complete and 0 interrupted iterations
default   [  51% ] 20/20 VUs  0m36.0s/1m10.0s

running (0m37.0s), 20/20 VUs, 866 complete and 0 interrupted iterations
default   [  53% ] 20/20 VUs  0m37.0s/1m10.0s

running (0m38.0s), 20/20 VUs, 906 complete and 0 interrupted iterations
default   [  54% ] 20/20 VUs  0m38.0s/1m10.0s

running (0m39.0s), 20/20 VUs, 945 complete and 0 interrupted iterations
default   [  56% ] 20/20 VUs  0m39.0s/1m10.0s

running (0m40.0s), 20/20 VUs, 985 complete and 0 interrupted iterations
default   [  57% ] 20/20 VUs  0m40.0s/1m10.0s

running (0m41.0s), 20/20 VUs, 1024 complete and 0 interrupted iterations
default   [  59% ] 20/20 VUs  0m41.0s/1m10.0s

running (0m42.0s), 20/20 VUs, 1063 complete and 0 interrupted iterations
default   [  60% ] 20/20 VUs  0m42.0s/1m10.0s

running (0m43.0s), 20/20 VUs, 1103 complete and 0 interrupted iterations
default   [  61% ] 20/20 VUs  0m43.0s/1m10.0s

running (0m43.9s), 20/20 VUs, 1143 complete and 0 interrupted iterations
default   [  63% ] 20/20 VUs  0m44.0s/1m10.0s

running (0m44.9s), 20/20 VUs, 1183 complete and 0 interrupted iterations
default   [  64% ] 20/20 VUs  0m45.0s/1m10.0s

running (0m45.9s), 20/20 VUs, 1223 complete and 0 interrupted iterations
default   [  66% ] 20/20 VUs  0m46.0s/1m10.0s

running (0m46.9s), 20/20 VUs, 1263 complete and 0 interrupted iterations
default   [  67% ] 20/20 VUs  0m47.0s/1m10.0s

running (0m47.9s), 20/20 VUs, 1303 complete and 0 interrupted iterations
default   [  69% ] 20/20 VUs  0m48.0s/1m10.0s

running (0m48.9s), 20/20 VUs, 1343 complete and 0 interrupted iterations
default   [  70% ] 20/20 VUs  0m49.0s/1m10.0s

running (0m49.9s), 20/20 VUs, 1383 complete and 0 interrupted iterations
default   [  71% ] 20/20 VUs  0m50.0s/1m10.0s

running (0m50.9s), 20/20 VUs, 1423 complete and 0 interrupted iterations
default   [  73% ] 20/20 VUs  0m51.0s/1m10.0s

running (0m51.9s), 20/20 VUs, 1462 complete and 0 interrupted iterations
default   [  74% ] 20/20 VUs  0m52.0s/1m10.0s

running (0m52.9s), 20/20 VUs, 1502 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  0m53.0s/1m10.0s

running (0m53.9s), 20/20 VUs, 1542 complete and 0 interrupted iterations
default   [  77% ] 20/20 VUs  0m54.0s/1m10.0s

running (0m54.9s), 20/20 VUs, 1582 complete and 0 interrupted iterations
default   [  79% ] 20/20 VUs  0m55.0s/1m10.0s

running (0m55.9s), 20/20 VUs, 1622 complete and 0 interrupted iterations
default   [  80% ] 20/20 VUs  0m56.0s/1m10.0s

running (0m56.9s), 20/20 VUs, 1660 complete and 0 interrupted iterations
default   [  81% ] 20/20 VUs  0m57.0s/1m10.0s

running (0m57.9s), 20/20 VUs, 1700 complete and 0 interrupted iterations
default   [  83% ] 20/20 VUs  0m58.0s/1m10.0s

running (0m58.9s), 20/20 VUs, 1740 complete and 0 interrupted iterations
default   [  84% ] 20/20 VUs  0m59.0s/1m10.0s

running (0m59.9s), 20/20 VUs, 1780 complete and 0 interrupted iterations
default   [  86% ] 20/20 VUs  1m00.0s/1m10.0s

running (1m00.9s), 19/20 VUs, 1820 complete and 0 interrupted iterations
default   [  87% ] 19/20 VUs  1m01.0s/1m10.0s

running (1m01.9s), 17/20 VUs, 1857 complete and 0 interrupted iterations
default   [  89% ] 17/20 VUs  1m02.0s/1m10.0s

running (1m02.9s), 15/20 VUs, 1890 complete and 0 interrupted iterations
default   [  90% ] 15/20 VUs  1m03.0s/1m10.0s

running (1m03.9s), 13/20 VUs, 1918 complete and 0 interrupted iterations
default   [  91% ] 13/20 VUs  1m04.0s/1m10.0s

running (1m04.9s), 11/20 VUs, 1943 complete and 0 interrupted iterations
default   [  93% ] 11/20 VUs  1m05.0s/1m10.0s

running (1m05.9s), 09/20 VUs, 1964 complete and 0 interrupted iterations
default   [  94% ] 09/20 VUs  1m06.0s/1m10.0s

running (1m06.9s), 07/20 VUs, 1981 complete and 0 interrupted iterations
default   [  96% ] 07/20 VUs  1m07.0s/1m10.0s

running (1m07.9s), 05/20 VUs, 1994 complete and 0 interrupted iterations
default   [  97% ] 05/20 VUs  1m08.0s/1m10.0s

running (1m08.9s), 03/20 VUs, 2003 complete and 0 interrupted iterations
default   [  99% ] 03/20 VUs  1m09.0s/1m10.0s

running (1m09.9s), 01/20 VUs, 2008 complete and 0 interrupted iterations
default   [ 100% ] 01/20 VUs  1m10.0s/1m10.0s


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=2.35ms


  █ TOTAL RESULTS 

    checks_total.......: 4018    57.125122/s
    checks_succeeded...: 100.00% 4018 out of 4018
    checks_failed......: 0.00%   0 out of 4018

    ✓ status is 200
    ✓ response time < 500ms

    CUSTOM
    errors.........................: 0.00%  0 out of 2009

    HTTP
    http_req_duration..............: avg=1.69ms   min=614.23µs med=1.62ms   max=21.61ms  p(95)=2.35ms   p(99)=2.74ms   p(50)=1.62ms  
      { expected_response:true }...: avg=1.69ms   min=614.23µs med=1.62ms   max=21.61ms  p(95)=2.35ms   p(99)=2.74ms   p(50)=1.62ms  
    http_req_failed................: 0.00%  0 out of 2009
    http_reqs......................: 2009   28.562561/s

    EXECUTION
    iteration_duration.............: avg=502.58ms min=500.85ms med=502.54ms max=522.91ms p(95)=503.51ms p(99)=503.97ms p(50)=502.54ms
    iterations.....................: 2009   28.562561/s
    vus............................: 1      min=1         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 769 kB 11 kB/s
    data_sent......................: 149 kB 2.1 kB/s



running (1m10.3s), 00/20 VUs, 2009 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  1m10s